import React from 'react';
import Main from './Main';
import './styles/First.css';
import img1 from "../assets/img1.png";
import img2 from "../assets/img2.png";
import img3 from "../assets/img3.png";
import img4 from "../assets/img4.png";
import img5 from "../assets/img5.png";
import img6 from "../assets/img6.png";
import img7 from "../assets/img7.png";
import img8 from "../assets/img8.png";
import img9 from "../assets/img9.png";
import img10 from "../assets/img10.png";
import img11 from "../assets/img11.png";
import img12 from "../assets/img12.png";
import img13 from "../assets/img13.png";
import img14 from "../assets/img14.png";
import img15 from "../assets/img15.png";
import img16 from "../assets/img16.png";
import img17 from "../assets/img17.png";
import img18 from "../assets/img18.png";
import img19 from "../assets/img19.png";
import img20 from "../assets/img20.png";
import img21 from "../assets/img21.png";
import img22 from "../assets/img22.png";
import img23 from "../assets/img23.png";
import img24 from "../assets/img24.png";
import img25 from "../assets/img25.png";
import img26 from "../assets/img26.png";
import img27 from "../assets/img27.png";
import img28 from "../assets/img28.png";
import img29 from "../assets/img29.png";
import img30 from "../assets/img30.png";
import img31 from "../assets/img31.png";
import img32 from "../assets/img32.png";
import img33 from "../assets/img33.png";
import img34 from "../assets/img34.png";
import img35 from "../assets/img35.png";
import img36 from "../assets/img36.png";
import img37 from "../assets/img37.png";
import img38 from "../assets/img38.png";
import img39 from "../assets/img39.png";
import img40 from "../assets/img40.png";
import img41 from "../assets/img41.png";
import img42 from "../assets/img42.png";
import img43 from "../assets/img43.png";
import img44 from "../assets/img 44.png";


export default function First(){
	return(
		<div className="first">
			<Main name="Мәтінді өңдеуге, талдауға қатысты бағдарламалар" desc=""/>
			<div className="sites">
				<div className="blocks">
					<div className="block">
						<p>
							<p styles={{textAlign:'center'}}>&nbsp;ІІ. МӘТІНДІ ӨҢДЕУГЕ, ТАЛДАУҒА ҚАТЫСТЫ БАҒДАРЛАМАЛАР</p>
							<br/>2.1	Фонетикалық, грамматикалық талдау жүргізуге, дыбыс тануға    арналған бағдарламалар
							<br/>Зерттеу жұмысымыз компьютерлік технологияға негізделген әдістер арқылы лингвистикалық зерттеулер жүргізудің тиімділігіне арналғандықтан, жалпы лингвистикада қолданылып жүрген компьютерлік бағдарламалар мен интернет-ресурстарды жинақтадық. Лингвистикалық зерттеулер жүргізуге арналған интернет-ресурстар мен бағдарламаларды келесідей тематикалық топтарға бөліп қарастыруға болады:
							<br/>-	Анализ жасау мен мәтінге лингвистикалық өңдеу жүргізуге арналған бағдарламалар;
							<br/>-	Мәтінді түрлендіруге арналған бағдарламалар;
							<br/>-	Психолингвистикалық бағдарламалар;
							<br/>-	Мәтіндер генераторлары және дыбыстайтын бағдарламалар;
							<br/>-	Ресурстар қоры;
							<br/>-	Сөздіктер мен тезаурустар. 
							<br/>Бұл бағдарламалар мен ресурcтар мәтінді, тілдік бірліктерді компьютерлік өңдеу және талдау жүргізу барысында қолдануға арналған жаңа технологиялар болып табылады. Анализ жасау мен мәтінге лингвистикалық өңдеу жүргізуге арналған бағдарламаларға біріншіден Audacity бағдарламасын жатқызуға болады. Бұл тегін қолданыстағы Windows, Mac Os X, GNU Linux және басқа да операциялық жүйелерге арналған дыбыстық редактор және рекордер. Бұл бағдарламаны көбіне лингвистикалық зерттеу жүргізуде қолданады. 
						</p>
						<img src={img1} alt=""/>
					</div>
					<br/>
					<br/>
					<br/>
					<div className="block">
						<p>
							&nbsp;Лингвистикалық зерттеуде фонетикалық дыбыс танығыш болып табылатын бұл бағдарлама дауыстың жиілігін, дауыс ырғағы, темпі, тембрін бақылап, жиілігін түзіп береді. Қазақ тіл білімінде ауызша тілге қатысты зерттеулердің кенжелеп қалуының себебі де бізде зерттеулерде осындай бағдарламалар қолданылмайтын болғандықтан болса керек. Сол себепті де қазақ тіл білімінде лингвистикалық зерттеулер жүргізуде дәстүрлі әдістерден компьютерлік технологияға негізделген әдістерді қолдану өз жемісін береді деп сенеміз. Жалпы, аталған бағдарламада келесідей қызмет түрлері бар: 
						</p>
						<img src={img2} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Көріп отырғанымыздай, бұнда дыбысты микрофоннан, микшерден жазып алуға, дыбыстық файлдарды импорттау, экспорттау, яғни тасымалдау, жинақтауға болады. Дыбыс жиілігі жоғары сапада жазылады. Және де келесідей артықшылықтары мен қызмет түрлері бар:   
						</p>
						<img src={img3} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Аудосити бағдарламасын келесідей мақсаттарда пайдалануға болады, және келесідей артықшылықтары бар: 
							<br/>-	Сөйлеушінің сөзін, табиғи дыбыстарды жазып алуға; 
							<br/>-	Дыбыс жазғышқа жазылып алынған сөздерді, мәтінді Windows-та теріп береді; 
							<br/>-	Дыбысты сандық жазбаға немесе компакт дискілерге өңдеп көшіре аласыз; 
							<br/>-	Дыбыстық файлдарды WAV, AIFF, FLAC, MP2, MP3, Ogg Vorbis форматтарына өңдей аласыз;
							<br/>-	Жазылып алынған дыбыстық жазбаларды кесуге, көшіруге, басқа дыбыстық жазбалармен араластыруға, жалғауға болады.  
							<br/>-	Дыбыстық жазбаның жылдамдық қарқынын жоғарылатып, тмендетуге, дауыс жоғарылығын өзретуге болатын көптеген эффектілері бар; 
							<br/>Аудоситиді негізгі бет мәзіріндегі скачать, жүктеу батысрмасын басу арқылы келесі форматтарда жүктеп алуға болады: 
						</p>
						<img src={img4} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Келесі морфологиялық анализатор бағдарламасын қарастыратын болсақ, бұл интернет-ресурсында орыс / ағылшын тілдеріндегі сөздерді морфологиялық талдаудың on-line нұсқасы берілген. Енгізілген сөздің негізгі формасы мен морфологиялық талдауын алуға мүмкіндік береді. Бағдарламаның тілдік базасы Зализняк (орыс) және Мюллер (ағылшын) сөздіктері негізінде құрылған. Бұл орыс / ағылшын тілдеріндегі сөздерді морфологиялық талдаудың on-line нұсқасы. Енгізілген сөздің негізгі формасы мен морфологиялық ақпаратын алуға мүмкіндік береді. Бұнда төмендегі суретте көрсетілгендей сөз жазатын арнайы орын болады: 
						</p>
						<img src={img5} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Арнайы орынға сөзді жазу арқылы автоматты түрде морфологиялық талдау жасауға болады. Морфологиялық талдау төмендегідей жүргізіледі: 
						</p>
						<img src={img6} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Келесі   бағдарламасында екі нұсқа (MonoConc Pro 2.0 және MonoConc 1.5) - бұл символдық мәтіндердің корпусына арналған конкорданс құру бағдарламасы. Мәтіндердің көлемі бірнеше миллион сөзге жетуі де мүмкін. Әртүрлі іздеу режимдерінің мүмкіндіктері жүзеге асырылады: таңбалы маскировка, тұрақты тіркестер, контекстке қарай іздеу көмегімен. Ішкі түзету (HTML / SGML) бар мәтіндерді өңдеу кезінде тегтер келісімге енеді (бұл жақсы емес). Әртүрлі сұрыптау нұсқалары бар. Сөздер мен сөз тіркестерінің пайда болу жиілігінің функциялары қарастырылған. Индекстер мен сөз тіркестерін құруға болады. Екі бағдарлама Windows 95 және одан жоғары нұсқаларға арналған. MonoConc 1.5-де Windows 3.1 (16-биттік) нұсқасы бар.
							<br/>MonoConc 1.5 MonoConc Pro-ден сәл жеңілірек. Өкінішке орай, бұл екі бағдарлама да тегін емес. MonoConc Pro-ны білім беру мақсатымен пайдалануға лицензия құны 85,00 долларды құрайды, ал MonoConc 1.5 - 65.00 долларды құрайды. АҚШ-та, Техас штатында, Rice Университетінде, Мишел Барлоу негізін қалаған. 	
							<br/>	WordTabulatorv2.2бағдарламасын1997-2002 жылдары С.В.Логичев құрды. Windows 9x / NT / 2000 / XP-де мәтінді талдауға арналған бағдарламаның жаңа нұсқасы. Әртүрлі енгізу мәтіндері үшін берілген пішіндердің немесе сөздік формалардың реттелген индекстерін құруға мүмкіндік береді. Негізгі орыс тіліндегі шифрлардағы мәтіндерді түсінеді және HTML 4.01 форматында құжаттарды өңдеуді ескере отырып өңдей алады. Бүркемелеу символдары арқылы іздеу мүмкіндіктері; базалық формада көрсетілген сөз формаларының барлық модификацияларын іздеу мүмкіндігі; нәтижелерді контексте қарастыру; мәтіндердің екі жинағын салыстыру. Пайдаланушыға ыңғайлы графикалық интерфейс. Шығу индексі гипермәтін түрінде болады. Төменде негізгі мәзір берілген:
						</p>
						<img src={img7} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Екінші пунктте лингвистикалық өңдеу мен мәтін талдауына қатысты мақалалар мен еңбектер сілтемесі берілген: 
						</p>
						<img src={img8} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;WordTabulator программасының көмегімен берілген мәтіндер жиынтығында кездесетін элементтердің индексін жасай аласыз. Қажетті элементтер сөз формалары, N-грамм (берілген мәтіндегі сөз тіркестері) немесе фразалар (синтагмалар) болуы мүмкін. Бағдарлама мәтіндерді әдеттегі 1-байтты ANSI кодтауында, сондай-ақ көпбайтты UTF-8 кодтауында да өңдей алады. Бастапқыда бағдарлама тек орыс тіліндегі мәтіндер үшін әзірленді, бірақ оны басқа тілдерде де (мысалы, украин, исланд, швед және т.б.)  қолдануға болады. MS Windows үшін 32 биттік қосымша болып есептеледі. 					Бағдарлама орыс тіліндегі I, Ї (и), Ѣ (ять), Ѳ (фита), Ѵ (ижица) әріптерін ескере отырып, кириллица алфавитін дұрыс өңдейді, 1918 жылғы реформаға дейін қабылданған алфавиттік тәртіпте сөз формаларын құрастырады. Батыс Еуропа және Шығыс Еуропа диапазонындағы диакритикалық белгілерін де сапалы сұрыптап, өңдей алады. UTF-8 мәтінінде жалпы рұқсат етілген таңбалар болуы мүмкін (тіпті араб жазуы немесе қытай әріптері де; бірақ бұл таңбалар тек Юникод мәні бойынша оқылады).						Бағдарлама берілген мәтіннің белгілі бір бөлігіне ғана өңдеу, талдау жұмыстарын жүргізе алады, немесе тұтас мәтінмен жұмыс істеп, бір бөлігін талдау процесінен тыс қалдыра алады. Одан бөлек екі мәтін арасындағы қарастырылып отырған элементтер бойынша ұқсастықтар мен өзгешеліктерге де талдау жүргізе алады. 
<br/>Орыстілді мәтіндер үшін анализ жүргізуде базада тіркелген сөздердің қалыпты нормалары бойынша шектеу бар. Ол сөздер орыс тілінің морфологиясы бойынша барлық  септікке түрленген формада ізделеді. Керекті тілдік элементтерді іздеу сонымен қатар, жиі қолданылатын тіркестер арқылы да ізделеді.  
<br/>Талдау нәтижесі ретінде табылған мәтіндік элементтердің индекстері бар бар файл немесе файлдар шығады.  Бұл индекс әр әлементтің мәтінде кездесу жиілігін көрсеттеін және олардың контекстегі сілтемесі бар HTML форматында болуы мүмкін немесе қарапайым мәтіндік файлдағы жай тізім ретінде болуы мүмкін.  		

						</p>
					</div>
					
					<div className="block">
						<p>&nbsp;2.2	Мәтінді талдауға, түрлендіруге, өңдеуге қажетті бағдарламалар
							<br/>Мәтін талдауға арналған бағдарламалар қатарына Link Grammar Parser бағдарламасын жатқызуға болады.	Лингвистикалық анализге арналған кез келген бағдарлама мен сайт, интернет-ресурс көбіне зерттеудің дәстүрлі әдісінен біршама алдыда тұратыны белгілі. Сондай бағдарламалардың бірі Ресейде құрылған Лингвоанализатор бағдарламасы. Лингвоанализатор бағдарламасына кіретін болсақ, бұл жерден мәтін құрылымына математикалық талдау жүргізуге болатынын көреміз. Бағдарламаны қолдана отырып белгілі бір мәтіннің жазу стилінің орыстың қай авторының жазу стиліне жақын екендігін анықтауға болады. Бұл бағдарламада Ресейде құрылған бағдарлама болғандықтан, бағдарлама базасына орыстың жазушыларының авторлық эталондары енгізілген.  Төменде лингвоанализатор бағдарламасының басты бет, негізгі менюі  берілген: 
						</p>
						<img src={img9} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Көріп отырғандарыңыздай, бұнда русская фантастика, қолжазба мен файлдарды қабылдау, база құрамы, каталог, т.б. терезелер бар. 
<br/>Бағдарламаны қолдана отырып, сіз белгілі бір мәтінді оқымастан-ақ, ол мәтіннің қай жазушы стиліне жақын екендігін анықтай аласыз.  Және де бұл бағдарлама жазушылардың жазу стилінен хабары жоқ тұтынушыға да таптырмас құрал. Одан бөлек, әдебиетті жаны сүйер, жекелеген жазушылардың авторлық стилін танып үлгерген оқырман да осы бағдарламаны қолдана отырып, авторлық қолтаңбаны ажырата алудағы өзінің қарым-қабілетін тексеруіне болады. Сіз мәтінді талдау жасауға енгізсеңіз бағдарлама үш автордың атын іріктеп шығарады. Бұл үш авторды бағдарламаберілген мәтіннің тілдің құрылымына математикалық талдау жасай отырып іріктеп шығарады. Олар берілген мәтіннің ықтималды авторлары немесе жәй ғана стильдік жағынан жақын авторлар болып табылады. 
						</p>
						<img src={img10} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Сіз енгізген мәтін арқылы бағдарлама сол мәтіннің ықтималды авторлары бола алатын (яғни тілі өте жақын авторлар) үш авторды ғана шығарып қана қоймай, олардың сол мәтінге тілдік жағынан ең жақын болып келетін үш шығармасын да алдыңызға шығарады. Бұл бағдарламаның авторы Д.В.Хмелев. Бағдарлама авторды тануға арналған алғашқы орыс тілді бағдарлама. Мәтін талдаудың жаңа әдісі мәтіндегі әріптердің бірізділігі формальді математикалық моделіне негізделген. Бұл әдіс А.А.Марковтың әдісі. Марков әдісі деп аталатын бұл әдіс тілдік элементтерді жасанды интеллект негізінде математикалық модельдеуден өткізетін есептемелі тілтанымда кеңінен қолданылатын әдіс. Марков әдісі бойынша әріптердің бірізділігі, әріп жұптарының қатар қолданылу жиілігі авторды тезірек анықтауға септігін тигізетін тәсіл екендігі анықталған. Бағдарламада енгізілген бұл әдіс сексен екі автордың туындыларына эксперимент жүргізу нәтижесінде анықталған екен. Бағдарламада келесідей пункттер бар: 			
<br/>- Мәтін анализі
<br/>-	Мысалдыр мен түсініктермелерді көру;
<br/>-	Бағдарлама жұмысы туралы толық мәлімет;
<br/>-	Бағдарлама жұмысының принциптерінің математикалық сипаты туралы;
<br/>-	Анализатор базасындағы шығармалар тізімі;
<br/>-	Жиі қойылатын сұрақтар мен жауаптар;
<br/>-	Авторлық стильді анықтау әдісі өңдемесінің қысқаша тарихы;
<br/>-	Лингвоанализаторғақатысы бар ресуртардың шағын катологы;
<br/>-	Мәтінді анықтау, тану тсатистикасы;
<br/>-	Лингвоанализатордың даму хронологиясы.
<br/>Мәтіндік талдауға елу-жүз килобайт көлемнен кем емес мәтін таңдалу керек. Бұндай көлем мәтіндік талдауды барынша сапалы жүргізу үшін қажет. Базаға жүз жиырма сегіз автордың мың үш жүз отыз жеті шығармасы енгізілген. Бағдарлама әлемдегі бірінші авторды тануға арналған бағдарлама екендігі туралы ақпараттар бар. Бұл туралы бағдарламаның «Бағдарлама жұмысы туралы толық мәлімет» бөлімінде айтылған. Авторды тануда жоғарыда айтып өткеніміздей мәтіннің стиліне, тілдік ерекшелігіне математикалық талдау жүргізіледі. Бірақ бағдарламада мәтін идеясы, фабуласы, мазмұнына анализ жүргізілмейтінін ескере кету керек. Бағдарлама тілдің келесідей формальді сипаттарына негізделген математикалық модель арқылы жұмыс істейді:
<br/>А)көмекші сөздер құрамы
<br/>ә)сөздерде қолданылатын морфемалар (приставка, суффикс, жалғау)
<br/>б) қолданылған грамматикалық құрылымдардың күрделілігі,
<br/>в) автордың өзіндік стиліндегі «меншікті» сөздері. 
	<br/>Мәтін талдауы келесідей жүргізіледі, енгізілген мәтін базадағы авторлардың стиль тілі бойынша математикалық модельдеуге түседі, сосын мәтін тіліне жақын үш автор таңдалынып алынады. Мәтін талдауға ол туралы ғылыми комментарийлер де жазылады. 

						</p>
					</div>
					<div className="block">
						<p>
							&nbsp;Талданған мәтіннің қаншалықты дәл талдау процесінен өткендігін статистикаға қарап көруге болады: 
						</p>
						<img src={img11} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Келесі бағдарлама Textual Analysis Computing Tools (TACT) бағдарламасы. АҚШ-та, Индиана университетінде құрылған. Торонто университетінің зерттеушілер тобы әзірлеген ASCII мәтінді өңдеуге арналған бағдарламалық жасақтама пакеті. Пакетке мәтіндік белгілерді автоматтандыруға арналған бағдарламалар кіреді; сөздердің тізбесін құру; мәтіндегі сөздердің ұзындығы мен жиілігі бойынша таралуын талдау; құрылыс келісімі және тағы да басқалары енеді. Өкінішке орай, барлық бағдарламалар ескі бағдарламалар және DOS үшін жасалған. Алайда, TACTWeb 1.0 пакетінің онлайн нұсқасы бар.							TACT – бұл DOS-тың қосымшасы, оның құрамына Торонто университетінің зерттеушілер тобы әзірлеген 15 бағдарлама кіреді (TACT-тің ақпараттық веб-сайты бар, TACT веб-нұсқасын қазір де алуға болады).TAСT бағдарламаларының бір тобы қолданушыға оның мәтіндерін белгілеуге көмектесу үшін жасалған (белгілеу талдауды жеңілдетеді: мысалы, егер сіз басқа біреу айтқан әр үзіндідің алдына белгі қойсаңыз, белгілі бір сөзді белгілі бір адамның сөйлеуінде пайда болған кезде ғана таба аласыз). Басқа топ ASCII мәтіндік файлдарынан мәтіндік деректер базасын (TDB) жасайды. Басқа топ мәтінді талдауға арналған құралдарды ұсынады: Usebase-де сіз сөздерді, сөз тіркестерін және сөздердің санаттарын іздей аласыз және нәтижелерді әртүрлі форматта көрсете аласыз; TACTstat сөздің ұзындығы мен сөз жиілігі бойынша статистикалық мәліметтер шығарады; TACTfreq алфавиттік, кері алфавиттік және жиіліктегі сөздердің кему тізімдерін жасайды; Анаграммалар мәтіндегі сөздердің анаграммаларын тізімдейді; FCompare ұқсас және ұқсас емес сызықтарды бөліп, екі файлды салыстырады, яғни талдауға ұсынылған екі мәтіндегі сөздердің ұқсастығы мен ерекшелігін сараптайды; TACTsort файлдың жолдарын сұрыптайды; HSM2TDB - бұл орта ғасырдағы Испан семинариясының (HSMS) белгілеу схемасын қолдана отырып, мәтіннен мәліметтер базасын құратын жаңа бағдарлама. 	
						</p>
					</div>
					<div className="block">
						<p>
							&nbsp;Ендігі қарастыратын бағдарлама мәтінді түрлендіруге арналған xMarkup утилитасы. Утилита (ағылш. Utility) – жалпы программалық қамтамасыздандырудың көмекші бөлігі. Ол жабдықтау мен операциялық жүйелеге қатысты арнайы типтегі міндеттерді орындауға арналған. Бағдарлама көптеген мәтіндік файлдардағы жолдық түрлендірулерді іске асырады. Ол көбіне келесідей мақсаттарда қолданылады:  
<br/>-	HTML-құжаттар жиынтығында навигациялық гиперсілтемелерді құру немесе редакциялау;
<br/>-	SGML / XML / HTML құжаттары мазмұны және/немесе құрылымын   талдау және түрлендіру;
<br/>-	берілген сценарий бойынша мәтіндік файлдарды автоматты түрде редакциялау;
<br/>-	мәтіндерді талдау және өңдеу: оның элементтерін таңдау және түрлендіру;
<br/>-	мәтін элементтерін графикалық визуализациялау;
<br/>-	символдық деректерді талдау, өңдеу және визуализациялаудың қолданбалы міндеттері.						
<br/>Бағдарлама тегін қолданыстағы бағдарламалар категориясына жатады.  
<br/>Мәтінді автоматты өңдеу бағдарламасы РГГУ универститетінің филология факультетінде құрылған жоба. Университетте лингвистика факультетінде Жасанды Интеллект бөлімі ашылып, ол жерде студенттер информациялық технлогиялар, бағдарламалау тілдері мен лингвистика саласын қатар оқып шығатын болды. Жаңа бөлім студенттері информацилық технологияларды лингвистикадан көбірек оқитын болды. Негізгі бөлім, яғни Жасанды Интеллект бөлімі құрылғанға дейінгі Лингвистика факультеті студенттері фонетика, морфология, синтаксис, семантика, типология, компаративистиканы оқыды. Олар міндетті түрде кемінде екі шет тілін үйренетін. Ал Жасанды Интеллект бөлімі студенті бір щшет тілін, лингвистикалық курстарды, математика (математикалық анализ, дискрет, логика, сызықты алгебра, т.б.) және өте көп бағдарламалау тілдерін (С, С++, Pascal, Prolog, Lisp, Delphi, SQL, Java, т.б.) үйренетін болды. Негізгі бөлім түлектері аудармашы, немесе, хатшылық секлді қызметтерді таңдаса, Жасанды Интеллект бөлімі түлектері бағдарламашы болып кететін болған. Бірақ екі бөлім түлектері бірігіп, мәтінді автоматты өңдеу яғни теориялық лингвистиканың заманауи компьтерлік технологиялармен интеграциялануы бағытына кеткен болатын.								Мәтіндерді автоматты өңдеу бағдарламасы (Автоматическая обработка текстов) бірнеше салаларда қолданылады екен. Атап айтқанда, «Интеллектуальный партнер» компаниясы (орыс морфологиясын Windows форматында), @Mail.ru компаниясы (орыс морфологиясы FreeBSD форматында), Лукойл-Информ (ағылшын, орыс тілі морфологиясы), ВААЛ жобасы (синтаксис пен тезаурустар Windows форматында), Ресей Ұлттық Зерттеу Институты, Жасанды интеллект бөлімі (ағылшын және орыс морфологиясы, Windows форматында), Megaputer Intelligence компаниясы (ағылшын және орыс морфологиясы, Windows форматында) т.б. қолданысқа енгізілген. 
<br/>Бағдарлама қалай жұмыс істейді: 					Морфологиялық тлдау жүргізу. Қолданушы орыс, ағылшын, немесе неміс сөз формасын енгізеді. Енгізілген сөз формаға морфологиялық талдау жүргізіледі. Берілген сөзформаға қажетті жағдайда парадигмалық талдау да жүргізіледі.  										Синтаксис. Қолданушы орыс тілінде сөйлем енгізеді. Сол арқылы сөйлем синтаксисі талдау нәтижесіне қол жеткізе алады. 					Аударма. Орыс тілінен ағылшын тіліне аударма жасау. Бұл кезде графематикалық, морфологиялық, синтаксистік анализаторлардың нәтижелері қолданылады.									Массив іздеу. Морфологиялық анализатор белгілеген массивтен тілдік бірліктерді іздеу. Сөз табы мен морфологиялық сипаты арқылы іздей аласыз. Белгіленген корпус алты жүз сексен миллион сөзден тұрады.  

						</p>
						<img src={img13} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Бағдарламаның негізгі беті осындай. Енді жүктелген бағдарлама бойынша жұмыс істеуді көрсететін болсақ, Бұл бағдарлама путон бағдарламасы арқылы оқылады екен. 												Бұл бағдарламаның технологиясы ФРАП жүйесінен алынған табиғи тілдің барлық деңгейін қамтитын базамен қамтамасыздандырылған. ФРАП дегеніміз орыс тіліндегі Французский-русский автоматический перевод, қазақша француз-орыс тіліндегі автоматты аударма жүйесі. Бұл жүйе 1976-1986 жылдары арасында Жалпыкеңестік орталықтың машианлық аударма қызметкерлері лабораториясы мен М.Торез атындағы машиналық аударма қызметкерлерінің бірігіп жасап шығарған жобасы. Тілдің модельді құрайтын компоненттер лингвистикалық процессорлар. Бұл поцессорлар бірінен соң бірі енгізілетін сөздерді өңдеп отырады. Келесідей компоненттер бар: 						- Графематикалық талдау. Сөздерді, сандық комплекстерді, формулаларды ерекшелеу, т.б.
<br/>-	Морфологиялық талдау. Енгізілген сөздің морфологиялық интерпретациясын құру.
<br/>-	Синтаксистік талдау. Сөйлем сөздерінің байланысу тұтастығын көрсету. 
<br/>-	Семантикалық талдау. Мәтіннің семантикалық графасын құру.		Бағдарламамен онлайн жұмыс істеу келесідей жүргізіледі: 

						</p>
						<img src={img14} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Егерде, Морфология батырмасын басатын болсақ, бірнеше тілді таңдау мүмкіндігі бар, және талдауға енгізу керек сөзді жазатын орын пайда болады:
						</p>
						<img src={img15} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Жекелеген сөздерге талдау жасау процесі келесідей жүргізіледі:
						</p>
						<img src={img16} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Синтаксистік талдау жүргізіп көрейік, Бағдарлама орыс тілі мен ағылшын тілі тілдік бірліктеріне талдау жүргізетін болғандықтан, орыс тілінде бір сөйлемге талдау жүргізіп көрейік. Біз талдау жасау үшін «Диакритические знаки – это знаки, которые добавляются к букве с целью обозначить изменение ее произношения или указать на какую-либо особую роль звука в данном слове» деген сөйлемді алдық. Енді синтаксисік талдауға көз жүгіртіп көрейік: 
						</p>
						<img src={img18} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Ендігі кезекте психолингвистикалық бағдарламалар туралы сөз қозғайық. Психолингвистикалық бағдарламалар туралы айтатын болсақ, ПСИ-Офис 2.1нұсқасы бағдарламасы бар. Бағдарламаның авторы Вадим Сысуев. 		3 бірнеше компоненттен тұратын  мәтіндерді психолингвистикалық талдау жүйесі:													- мәтіннен ендірілген сөздерді іздеуге арналған бағдарлама, яғни сөздер арасында және сөз ішінде «жасырынған» сөздерді іздеуге арналған			 - «Автоматты түрде жазуға» анализ жүргізгенде кездесетін қайталанып келе беретін сөздерді, фрагменттерді іздеуге арналған бағдарлама (мұндай мәтіндер ағымдағы бейсаналы процестерге талдау жүргізу мақсатында, мысалы, гипнозға түсу, түс көру, қатты қорқу, ұмыта алмайтын өкініш, медитация процестері, т.б. жазылады)								 - Мәтіннің бейсаналық компонентіне арналған синтездік бағдарлама. Енді осы аталған үш пунктке жеке-жеке түсініктеме беріп өтсек. Біріншісі «жасырынған» сөздер деген қандай сөздер? «Жасырынған» сөздер сөз ішінде немесе сөздер арасында жасырынған сөздер. Пси-Офис бағдарламасы сайтында ол сөздерді былай көрсетеді: «Веселей» (вес весел веселей  еле лей елей сел) демек, бұнде жеті жасырын сөз бар деуге болады, немесе «Задень гитару  (за деньги тару). 								«Жасырын» сөздерді табу бағдарламасы екі мақсатты көздейді. Біріншісі, қолданушы, яғни бадарламаны қолданып отырған адамның  бәлки өзі де білмейтін, оның бейсанасында (подсознание) жатқан жасырын ойды анықтау. «Жасырын» сөздерді анықтау адамның өзгеден тіпті кейде өзінен де жасыратын құпия тілек, қалауларын, ойларын, бейсаналық қағидаларын (подсознательные установки) анықтауға көмектеседі. Екіншісі, адамның бейсаналық ойлау деңгейіне әсер етеін сөздер, сөз тіркестерін құрудың ережелерін айқындау. Яғни, адам ол сөздерді естіп, тыңдап, не оқып отырғанда оның қалыпты ойлау санасы (сознание) жаңағы «жасырын» сөздерді байқамайды, ол «жасырын» сөздер адамның бейсанасына (подсознание) әсер етеді.									«Автоматты түрде жазуға» анализ жүргізгенде кездесетін қайталанып келе беретін сөздерді, фрагменттерді іздеуге арналған бағдарлама, яғни қоданушы автоматты түрде сздерді тереді, ал бағдарлама адамның бейсаналы дееңгейіндегі сөздерді анықтайды. Қайталанып келе беретін сөздердің жиілігін анықтау арқылы адамның психологиялық жай-күйінде ол үшін қай сөздер, ұғымдар актуальды болып тұрғандығын, адамды не мазалап тұрғанды,ын анықтайды. Мұндай мәтіндер ағымдағы бейсаналы процестерге талдау жүргізу мақсатында, мысалы, гипнозға түсу, түс көру, қатты қорқу, ұмыта алмайтын өкініш, медитация процестерінде жазылады.				Ал енді бағдарламамен қалай жұмыс істеуге болатынын түсіндірейік. Адам компьтердің алдында бір бөлмеде жалғыз отыруы керек. Бұл психолингивстика саласына арналған бағдарлама болғандықтан, адам өз подсознаниесімен жұмыс істеуі керек болғандықтан,  ол қалыпты ойлау санасын (сознание) «өшіріп», бейсанасын (подсознаниесін) «қосу» керек. Бөлмеде жалғыз қалып, ойы басқа заттарға бөлінбеуі үшін жарықты алакөлеңке етіп, уиндоустың рекдакторын реттеп, монитордың жарығын өшіріп, өзі трансқа түскен қалыпта отырып, ойына бейсаналы түрде келген сөздердің БАРЛЫҒЫН тоқтаусыз, еш ойланбастан, өз-өзінен қымсынбастан, санасын (сознание) «өшірген» күйде, бейсанасын (подсознание) «қосқан» күйде жаза беру керек. Көп адам бұл бағдарламамен жұмыс істегенде өз-өзін тежеп қалады екен, яғни ойына келген сөздерді бірден жазып кете алмайды екен. Оған себеп, адамның бейсанасында тіпті кейде өзі де шошитын сөздер, ойлар жатуы мүмкін. Мұның бәрі адамның психологиялық проблемалары себебінен адамның санасынан тереңгі қабаты бейсанада «тығылып» жатқан сөздер. Адамға кейде ол  сөздерді білу өзіне де ауыр тиюі мүмкін. Сондықтан адамның табиғатында сондай ерекше құбылыс бар, адамға ауыр тиетін сөздерді оның санасы (сознание) бейсанаға (подсознание) тығып тастайды екен, солайша сана адамды ауыр күйзелістерден, не өзін кешіре алмаушылықтан, не біреуді кешіре алмаушылықтан, не ауыр шындықты қабылдай алмаушылық дегендей ойлардан сана автоматты түрде адамды «қорғап» отырады екен. 					Бағдарлама адамның психологиялық жай-күйіне, нақты айтқанда «поток сознании» құбылысын анықтауға арналған. Адамдар,бейсаналы түрде трансқа түскен күйде сөздерді жазып болған соң, мониторды қосып, өзінің жазған сөздерін оқып көреді. Бұл адамға өз-өзінің шынайы болмысымен «бетпе-бет» келуіне, мазалап жүрген ауыр ойларынан арылуға көмектеседі. Адам ойына келген көптеген сөздерді жаза береді, сөздердің көлемі өте ауқымды. Ал бағдарлама олардың ішіндегі қайталанған, сөздердің жиілігін анықтау арқылы, оларды не алфавиттік ретпен, не сөздердің ұзындығы ретімен, не жиіліктің мол болуы ретімен анықтап береді. 
						</p>
					</div>
					<div className="block">
						<p>
							&nbsp;2.3	Лингвистикалық зерттеу жүргізуге қажетті өзге де интернет-ресурстар мен сөздіктер

<br/><br/>Лингвисткиалық зерттеу жүргізуге қажетті өзге де интернет-ресурстар қатарына Omniglot.com, sozdik.kz, linguist.ru т.б. сайттар мен интернет-ресурстарды жатқызуға болады. Omniglot.com  сайтында түркітану саласында, жалпы тіл білімі саласында глоттохронологиялық, салыстырмалы тіл білімімен айналысып жүрген зерттеушілерге қажетті мәліметтер кездеседі. Бұл тілдер мен жазу жүйесіне арналған онлайн энциклопедия. Ол жерде түрлі тілдік семьялардағы тілдердің тіл тарихы, жазу жүйесі, тілдік еркешелігі, фонетикасы, грамматикасы, лексикасы, т.б. туралы мәліметтер бар. Омниглот сөзі этимологиясы  латын тіліндегі омнис- барлық, және грек тіліндегі глот – тіл сөздерінен құралған. Яғни, бұл сайтта барлық тілдер туралы мәліметтер кездеседі. Веб сайтты лингвист Симон Эйгер 998 жылы құрған. Онлайн энциклопедияның негізгі бет менюі мынадай: 
						</p>
						<img src={img20} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Сайттан түрлі тілдердің жазу жүйесі, жазу тарихы туралы мәліметтер алуға болады. Келесі суретте жазу жүйесі туралы мәліметтерді іздеу жүйесі көрсетілген: 
						</p>
						<img src={img21} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Бұнда жазу жүйесі, жазу түрлері, жазу мен сөйлеу арасындағы айырмашылық, тіл және жазу статистикасы, барлық тілдер, тілдер семьясы бойынша тілдер, т.б. мәліметтер бар.  Тілдер деген батырманы бассаңыз, барлық тілдер алфавиттік ретпен беріліп тұрғанын көресіз: 
						</p>
						<img src={img22} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Араб тілінің Кипрлік, Египеттік, Либаниздік, Сириялық, Марокколық т,б, түрлері бар екен. Біз Егиептік араб тілін таңдап, батырмасын басып көрдік: 
						</p>
						<img src={img23} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Көріп тұрғандарыңыздай, бұнда алфавиттен бастап, дыбыстау ерекшеліктері, бейінделген мәтіндер, сөздердің дыбысталуы берілген. Ал оның астында сол мәтіннің аудармасы (ағылшын тілінде), және видеосы бар: 
						</p>
						<img src={img24} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Линкс деген жерінде араб тілін үйренуге арналған интернет-ресурстардың мол қоры көрсетілген: 
						</p>
						<img src={img25} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Сонымен қатар сайттан жазу жүйесіне қатысты кеңінен мәлімет алуға болады: 
						</p>
						<img src={img26} alt=""/>
					</div>
					<div className="block">
						<img src={img27} alt=""/>											
					</div>
					<div className="block">
						<img src={img28} alt=""/>										
					</div>
					<div className="block">
						<img src={img29} alt=""/>										
					</div>
					<div className="block">
						<img src={img30} alt=""/>										
					</div>
					<div className="block">
						<img src={img31} alt=""/>										
					</div>
					<div className="block">
						<img src={img32} alt=""/>										
					</div>
					<div className="block">
						<p>
							&nbsp;Түрлі жазу жүйесі туралы мол ақпаратты тауып қол жеткізуге болады. Бұдан бөлек, сайттан лингвисткалық зерттеуге арналған әдебиеттерді табуға болады. 	Sozdik.kz сайты да өз кезегінде тиімді зерттеу жүргізуге көмегін тигізетін электронды сөздіктердің бірі. Бұл сөздікте сөйлемдер, мәтіндер емес жекелегн сөздер аударылады. Сөздер тура мағынасында, ауыс мағынасында және түрлі ғылым саласындағы терминдік мағынасында аударылады. Сөздік орыс-қазақ тілі тілдік жұптары арасында аударма жасайды. 
						</p>
						<img src={img33} alt=""/>
					</div>
					<div className="block">
						<p>&nbsp;Бағдарламаға тіркеліп, тұрақты қолданушы болуға болады, болмаса, интернет желісіндегі еркін қолданушы болуа да болады. </p>
						<img src={img34} alt=""/>
					</div>
					<div className="block">
						<p>&nbsp;Қолданушы белгілі бір сөзді сөз жазатын орынға енгізіп, өзіне қажетті аударманы ала алады, біз мнимый сөзін аударып көрдік</p>
						<img src={img35} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Аударма нәтижесі келесідей болды: 
						</p>
						<img src={img36} alt=""/>
					</div>
					<div className="block">
						<img src={img37} alt=""/>
					</div>
					<div className="block">
						<img src={img38} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Ағылшын тіліндегі Sleng.dic онлайн жаргон электронды сөздігі де лингвистикалық зерттеу жүргізуде өз септігін тигізеді. Бұл жерден ағылшын тілі қолданысында соңғы кездері пайда болған жаңа жаргондар топтамасын табуға болады. Әрі өзіңіз қалаған кез келген ағылшын жаргонынының 
мағынасын анықтай аласыз. 
						</p>
						<img src={img39} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Келесі қарастыратын бағдарламамыз Dialing.ru сайты интернет-ресурстары. Dialing.ru сайтында ағылшын тілін үйренгісі келетіндер мен ағылшын лингвисткасымен айналысатын адамдарға арналған интернет ресурстар тіркелген. Атап айтқанда, далалық зерттеу мен маркетингілік зерттеу жүргізуге арналған қоңырау шалуға арналған Nebu Dialer бағдарламалық-қызмет көрсету құрылғысы. Оны DaaS қызмет көрсету бағдарламасы деп те атайды. Dialing.ru сайты орыс тілінен ағылшын тіліне (және керісінше) автоматты аударма жүйесін құру үшін мәтіндік талдау жүйесін қарастырады. Ол бірнеше автономды компоненттерден тұрады:
 <br/>- орыс тіліндегі мәтіндердің синтаксистік анализаторы;  
 <br/>- орыс және ағылшын тілдеріндегі мәтіндердің морфологиялық анализаторы;
 <br/>- берілген жиынтық мәтіндерге конкорданстар құру.   
<br/>Бұнда орыс (80 мың сөз) және ағылшын (60 мың сөз) тілдерінің морфологиялық сөздіктері қолданылады. Әрбір компонент үшін COM интерфейсі жасалынған, оны басқа қолданбалы жүйелерде қолдануға болады. Жүйе C++ бағдарлама тілінде жазылған және Windows 9x / 2000 / NT жүйесінде жұмыс істейді. Бұл ресурстың негізгі бет менюі келесідей: 
						</p>
						<img src={img40} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Nebu Dialer интернет ресурсын nebu.com сайтынан табуға болады. Nebu Data Suite құралдарымен маркетингтік зерттеулерді біріктіру және автоматтандыруға болады. Онда деректер жинауға, кез келген құрылғы, режим, ақпарат көздерін бір орталыққа шоғырландыруға арналған Collect құрылғысы, процесстер мен ақпараттарға арналған қауіпсіздік құралдар құрылғысы, Деректерді жоғары деңдейде пайдаланып, өңдеу, есеп беруді қамтамасыз ететін құрылғылар бар. Nebu Data Suite құралдары зерттеушілерге нарық сегменттерінде мәліметтерді жинауға, басқаруға және пайдалануға көмектеседі. Бұл интернет рерурс отыз төрт тілде жүз алпыс төрт мыңнан аса проектілерді іске асырып келеді. Тіл білімі саласы зерттеушілері үшін	бұл ресурстың тиімділгі оңай әрі ұтымды, тез, зерттеу жүргізетін аумақтың географиялық алаңының барлық кеңістігін қамтып сауалнамалар жүргізуге, далалық зерттеу (полевая медот исследования) әдісімен жұмыс істеуді автоматтандыруға көмектеседі. Төмендегі суретте зерттеу жұмысы жобасы қалай жүргізілетіні көрсетілген
						</p>
						<img src={img41} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;All Modes – барлық модельдер
<br/>Any Time – кез келген уақытта
<br/>Any Place – барлық жерде
<br/>Any Source – барлық ақпарат көздері
<br/>Flexible - жұмсақ
<br/>Real-time – қазіргі уақытта
<br/>Intuitive – түйсікке негізделген
<br/>Secure - қауіпсіз деген бөлімдері бар. Оларды төмендегі суреттен көруге болады: 

						</p>
						<img src={img42} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Төмендегі суретте сайттың көрсететін қызмет түрлері берілген. Our products яғни, біздің өнімдер деген жерден Мәліметтер концентраторы, Қоңырау шалу қызметі, Басқару панелі, ағылшынша sample яғни, Үлгі, Байқап көру мағынасындағы пункт, Құралдар панелі, Ішінара қоңырау шалу қызметі, Мәліметтерді жинау қызметтері мен өнімдері бар екенін көреміз. 
						</p>
						<img src={img43} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Келесі StarLing жүйесі мультитілді мәтіндермен, транскрипт таңбаларымен, ыңғайлы іздеу жүйесі бар, Зализняк сөздігіне сәйкес сөз формаларын талдайтын және синтездейтін, Мюллер сөздігі арқылы аударатын жүйе. Бұнда салыстырмалы-тарихи зерттеулерге (глоттоохронология) арналған функциялар да бар. Жүктеу үшін жүйенің толық DOS және Windows нұсқалары бар. Сонымен қатар, базадан DJF форматында Ожегов және Зализняк сөздіктерін де жүктей аласыз.
<br/>Сайтта on-line режимінде әртүрлі тілдерге арналған этимологиялық мәліметтер базасы бар. Жүйе авторы С.А.Старостин. Жүйеге кіре салғанда келесідей басты мәзірді көресіз: 

						</p>
						<img src={img44} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;Мұнда көріп отырғандарыңыздай, бұнда алтай тілдері, үнді-еуропа тілдер семьясы, солтүстік кавказ тілдері, қытай, қытай-тибет тілдері, дравид, енисей тілдері туралы ақпараттарды көруге болады.  Яғни бұнда өте көп көлемде тілдік база енгізілген, және әр бөлімдегі тілдермен зерттеуші-тұтынушы оңтайлы зерттеу жұмыстарын жүргізе алады. 							Бүгінгі зерттеу жұмысымызда Лингвоанализатор, Dialing,ru, Nebu Dialer, StarLing жүйесі, TACT (Textual Analysis Computing Tools), Word Tabulator, xMarkup утилитасы, Мәтінді автоматты өңдеу бағдарламасы, ПСИОфис 2.1, Omniglot.com, т.б. бағдарламалары мен интернет-ресурстарын қарастырдық. Барлық дерлік бағдарламаларда тілдік бірліктер математикалық модельдеуге салынып, есептемелі тілтаным доминантты рөл атқаруда. Тіл білімі психология, әлеуметтану, антропология, мәдениеттану, тарих, акустикалық физика, математика ғылымдарымен айланыса дамып, түрлі жаңа салалар ғылым сахнасына келді. Солардың ішінде математика ғылымының методологиялық ерекшелігі лингвистика ғылымында ерекше орын алуда. Статистикалық лингвистика, лексикостатистика, нейролингвистика, т.б. ұғымдар осы тенденцияны аңғартады. Математика ғылымы әдістерінің лингвистикада кеңінен орын алуымен қатар, кибернетиканың да тіл біліміне еркін енуі байқалады. Жасанды интеллект пен тіл білімінің біріккен тұсы бүгінгі лингвистиканың жаңа бағытын айқындамақ.


						</p>
					</div>
				</div>
			</div>
		</div>
	);
}