import React from 'react';
import Main from './Main';
import './styles/First.css';
import img1 from "../assets/img1.png";
import img2 from "../assets/img2.png";
import img3 from "../assets/img3.png";
import img4 from "../assets/img4.png";
import img5 from "../assets/img5.png";
import img6 from "../assets/img6.png";
import img7 from "../assets/img7.png";
import img8 from "../assets/img8.png";
import img9 from "../assets/img9.png";
import img10 from "../assets/img10.png";
import img11 from "../assets/img11.png";
import img12 from "../assets/img12.png";
import img13 from "../assets/img13.png";
import img14 from "../assets/img14.png";
import img15 from "../assets/img15.png";
import img16 from "../assets/img16.png";
import img17 from "../assets/img17.png";
import img18 from "../assets/img18.png";
import img19 from "../assets/img19.png";
import img20 from "../assets/img20.png";
import img21 from "../assets/img21.png";
import img22 from "../assets/img22.png";
import img23 from "../assets/img23.png";
import img24 from "../assets/img24.png";
import img25 from "../assets/img25.png";
import img26 from "../assets/img26.png";
import img27 from "../assets/img27.png";
import img28 from "../assets/img28.png";
import img29 from "../assets/img29.png";
import img30 from "../assets/img30.png";
import img31 from "../assets/img31.png";
import img32 from "../assets/img32.png";
import img33 from "../assets/img33.png";
import img34 from "../assets/img34.png";
import img35 from "../assets/img35.png";
import img36 from "../assets/img36.png";
import img37 from "../assets/img37.png";
import img38 from "../assets/img38.png";
import img39 from "../assets/img39.png";
import img40 from "../assets/img40.png";
import img41 from "../assets/img41.png";
import img42 from "../assets/img42.png";
import img43 from "../assets/img43.png";
import img44 from "../assets/img 44.png";


export default function First(){
	return(
		<div className="first">
			<Main name="Мәтінді өңдеуге, талдауға қатысты бағдарламалар" desc=""/>
			<div className="sites">
				<div className="blocks">
				<div className="block">
						<p>&nbsp;<strong>ЛИНГВОАНАЛИЗАТОР. </strong> (<a href="https://rusf.ru">rusf.ru</a>) Сіз мәтінді талдау жасауға енгізсеңіз бағдарлама үш автордың атын іріктеп шығарады. Бұл үш авторды бағдарлама берілген мәтіннің тілдің құрылымына математикалық талдау жасай отырып іріктеп шығарады. Олар берілген мәтіннің ықтималды авторлары немесе жәй ғана стильдік жағынан жақын авторлар болып табылады. Бағдарлама тілдің келесідей формальді сипаттарына негізделген математикалық модель арқылы жұмыс істейді:
<br/>А)көмекші сөздер құрамы
<br/>ә)сөздерде қолданылатын морфемалар (пристивака, суффикс, жалғау)
<br/>б) қолданылған грамматикалық құрылымдардың күрделілігі,
<br/>в) автордың өзіндік стиліндегі «меншікті» сөздері. 
<br/>Морфология, синтаксис, стилистика саласында жұмыс жасайтын зерттеушілер белгілі бір типтегі мысалды табу үшін, кітаптарды ақтармайды, тек 1 мысалды бағдарламаға енгізу арқылы сол тектес мысалдарға, мәлімпеттерег қол жеткізе алады. 
<br/>
						</p>
						<img src={img9} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;<strong><a href="https://dialing.ru">DIALING.RU</a></strong> сайты орыс тілінен ағылшын тіліне (және керісінше) автоматты аударма жүйесін құру үшін мәтіндік талдау жүйесін қарастырады. Ол бірнеше автономды компоненттерден тұрады:
 <br/>- орыс тіліндегі мәтіндердің синтаксистік анализаторы;  
 <br/>- орыс және ағылшын тілдеріндегі мәтіндердің морфологиялық анализаторы;
 <br/>- берілген жиынтық мәтіндерге конкорданстар құру(конкорданс – қандай да бір тілідк бірліктің барлық мәтіндердегі қолданыстарының жиынтығы. Конкорданс – это список всех употреблений определенного языкового выражения в контексте и с ссылкой на источник при необходимости).   
<br/>Нәтижесінде, зерттеуші мәтіннің синтаксистік, морфолгиялық ерекшеліктерін, конкорданс құру мүмкіндіктерін ала алады. 

						</p>
						<img src={img40} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;<a href="https://nebu.com"><strong>nebu.com</strong></a> – деректер жинауға, кез келген құрылғы, режим, ақпарат көздерін бір орталыққа шоғырландыруға арналған. Тіл білімі саласы зерттеушілері үшін	бұл ресурстың тиімділгі оңай әрі ұтымды, тез зерттеу жүргізетін аумақтың географиялық алаңының барлық кеңістігін қамтып сауалнамалар жүргізуге, далалық зерттеу (полевой медот исследования) әдісімен жұмыс істеуді автоматтандыруға көмектеседі. (Прежде всего, полевая лингвистика, являясь экспериментальной областью знания, использует специальные методы извлечения лингвистической информации. Полевая лингвистика неразрывно связана с человеком-носителем языка, который является посредником между исследователем и языком. Исследователь получает все сведения о языке посредством активного взаимодействия с тем, кто владеет данным языком как родным и служит для исследователя экспертом, знания которого о языке исследователю необходимо извлечь (такой носитель языка называется обычно информантом/переводчиком).
						</p>
						<img src={img41} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;<strong>Морфологиялық анализатор.  (<a href="https://astarling.rinet.ru">astarling.rinet.ru</a>)</strong> Бұл орыс / ағылшын тілдеріндегі сөздерді морфологиялық талдаудың on-line нұсқасы. Енгізілген сөздің негізгі формасы мен морфологиялық ақпаратын алуға мүмкіндік береді. Арнайы орынға сөзді жазу арқылы автоматты түрде морфологиялық талдау жасауға болады. Орыс тіліндегі сөздің: нөлдік формасын, род, септелген түрі, шақ категориясы, рай түрі, причастие, деепричастие түріндегі формалары  көрсетіледі.
						</p>
						<img src={img5} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;<strong>TACTWeb 1.0</strong>  TACT – бұл DOS-тың қосымшасы, оның құрамына Торонто университетінің зерттеушілер тобы әзірлеген 15 бағдарлама кіреді (TACT-тің ақпараттық веб-сайты бар, TACT веб-нұсқасын қазір де алуға болады). Usebase-де сіз сөздерді, сөз тіркестерін және сөздердің санаттарын іздей аласыз және нәтижелерді әртүрлі форматта көрсете аласыз; TACTstat сөздің ұзындығы мен сөз жиілігі бойынша статистикалық мәліметтер шығарады; 
						</p>
					</div>
					<div className="block">
						<p>
							&nbsp;<strong>TACTfreq </strong>алфавиттік, кері алфавиттік және жиіліктегі сөздердің кему тізімдерін жасайды; Анаграммалар мәтіндегі сөздердің анаграммаларын тізімдейді; FCompare ұқсас және ұқсас емес сызықтарды бөліп, екі файлды салыстырады; Коллаген тізімдерінде қайталанатын тіркестер мен колокат түйіндерінің жұптары бар (бір-біріне бірнеше рет жақын орналасқан екі сөз);
						</p>
					</div>
					<div className="block">
						<p>
							&nbsp;<strong>WordTabulator.</strong>  WordTabulator программасының көмегімен берілген мәтіндер жиынтығында кездесетін элементтердің индексін (санын) жасай аласыз. Қажетті элементтер сөз формалары, N-грамм (берілген мәтіндегі сөз тіркестері) немесе фразалар,  (синтагмалар), әріп болуы мүмкін. Бағдарлама берілген мәтіннің белгілі бір бөлігіне ғана өңдеу, талдау жұмыстарын жүргізе алады, немесе тұтас мәтінмен жұмыс істеп, бір бөлігін талдау процесінен тыс қалдыра алады. Одан бөлек екі мәтін арасындағы қарастырылып отырған элементтер бойынша ұқсастықтар мен өзгешеліктерге де талдау жүргізе алады. Талдау нәтижесі ретінде табылған мәтіндік элементтердің индекстері бар бар файл немесе файлдар шығады.
						</p>
						<img src={img7} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;<strong>xMarkup</strong> –  жабдықтау мен операциялық жүйелеге қатысты арнайы типтегі міндеттерді орындауға арналған. Келесідей мақсаттарда қолданылады:  
<br/>-	HTML-құжаттар жиынтығында навигациялық гиперсілтемелерді құру немесе редакциялау;
<br/>-	SGML / XML / HTML құжаттары мазмұны және/немесе құрылымын   талдау және түрлендіру;
<br/>-	берілген сценарий бойынша мәтіндік файлдарды автоматты түрде редакциялау;
<br/>-	мәтіндерді талдау және өңдеу: оның элементтерін таңдау және түрлендіру;
<br/>-	мәтін элементтерін графикалық визуализациялау;
<br/>символдық деректерді талдау, өңдеу және визуализациялаудың қолданбалы міндеттері.


						</p>
						<img src={img13} alt=""/>
					</div>
					<div className="block">
						<p>
							&nbsp;<strong>Мәтінді автоматты өңдеу бағдарламасы (Автоматическая обработка текста)</strong> – Бағдарлама мынадай бағыттарда жұмыс жасайды: 			
<br/><i>Морфология	</i>										<br/>Қолданушы орыс, ағылшын, немесе неміс сөз формасын енгізеді. Енгізілген сөз формаға морфологиялық талдау жүргізіледі. Берілген сөзформаға қажетті жағдайда парадигмалық талдау да жүргізіледі.  
<br/><i>Синтаксис	</i>								
<br/>Қолданушы орыс тілінде сөйлем енгізеді. Сол арқылы сөйлем синтаксисі талдау нәтижесіне қол жеткізе алады. 					
<br/><i>Аударма </i>											<br/>Орыс тілінен ағылшын тіліне аударма жасау. Бұл кезде графематикалық, морфологиялық, синтаксистік анализаторлардың нәтижелері қолданылады.
<br/><i></i>										<br/>Морфолгиялық анализатор белгілеген массивтен тілдік бірліктерді іздеу. Сөз табы мен морфологиялық сипаты арқылы іздей аласыз. Белгіленген корпус алты жүз сексен миллион сөзден тұрады.  
Массив іздеу
						</p>
					</div>
					<div className="block">
						<p>
							&nbsp;<strong>ПСИ-Офис 2.1</strong> – бірнеше компоненттен тұратын  мәтіндерді психолингвистикалық талдау жүйесі:								- мәтіннен ендірілген сөздерді іздеуге арналған бағдарлама, яғни сөздер арасында және сөз ішінде «жасырынған» сөздерді іздеуге арналған			 - «Автоматты түрде жазуға» анализ жүргізгенде кездесетін қайталанып келе беретін сөздерді, фрагменттерді іздеуге арналған бағдарлама			 - Мәтіннің бейсаналық компонентіне арналған синтездік бағдарлама.	
						</p>
					</div>
					<div className="block">
						<p>
							
							<br/>&nbsp;<strong>Audacity</strong> - лингвисткиалық зерттеуде фонетикалық дыбыс танығыш болып табылатын бұл бағдарлама дауыстың жиілігін, дауыс ырғағы, темпі, тембрін бақылап, жиілігін түзіп береді. Дыбысты микрофоннан, микшерден жазып алуға, дыбыстық файлдарды импорттау, экспорттау, яғни тасымалдау, жинақтауға болады. Зерттеуші бағдарлама арқылы үлкен көлемдегі файлдармен аз уақытта жұмыс жасай алады. 
						</p>
						<img src={img1} alt=""/>
					</div>
					<br/>
					
				</div>
			</div>
		</div>
	);
}