import React from 'react';
import Main from './Main';
import './styles/First.css'

export default function Second(){
	return(
		<React.Fragment>
			<Main name="Лингвистикалық зерттеу жүргізуге қажетті өзге де интернет-ресурстар мен сөздіктер"/>
		<div className="sites">
		<div className="blocks">
		<p>
				1.	https://mtdi.kz/# МЕМЛЕКЕТТІК ТІЛДІ ДАМЫТУ ИНСТИТУТЫ
<br/>«Мемлекеттік тілді дамыту институты» ЖШС мемлекеттік тілді қолдану мен дамытуға өз тарапынан үлес қосу үшін құрылған. Негізгі қызметі :
<br/>
<br/>– Орыс және өзге тілдерден қазақ тіліне, қазақ тілінен өзге тілдерге аудармалар жасау. Түрлі мәтіндердің қазақ тілінің нормасына сай құрылғандығын тексеру, редакциялау, корректуралық тексерулерден өткізу, лингвистикалық кеңестер беру;
<br/>
<br/>– Жеке адамдарға, мемлекеттік қызметкерлерге мемлекеттік тілді үйрететін деңгейге бөлінген топпен және жекелей оқытатын курстар ұйымдастыру;
<br/>
<br/>– Тіл үйрететін, қазақша іс жүргізетін, аудармамен айналысатын мамандарға арнап біліктілігін арттыру курстарын жүргізу, курстарды сәтті аяқтағандарға сертификаттар беру.
<br/>
<br/>2.	http://otuken.kz/#   Қазақ мәдениеті, музыкасы мен  мифологиясы туралы сайт.
<br/>3.	https://www.softportal.com/software-17702-etxt-antiplagiat.html  
<br/>Etxt Анти-плагиат  (AntiPlagiarism.NET) - желідегі плагиатты іздеуге және мәтіндердің бірегейлігіне баға беретін бағдарлама. Оның көмегімен мәтіннің бірегейлігі үшін тез және сапалы тексеруге болады. Мәтіннің бірегейлігіне егжей-тегжейлі талдау жүргізуге және мақаланың өзіндік ерекшелігін пайыздық тұрғыдан анықтауға мүмкіндік береді. Бірегей емес фразаларды көрсетеді, оларды әр түрлі түстермен бөліп, оларды бірден өңдеуге және мәтінді қайта тексеруге жіберуге мүмкіндік береді.
<br/>Мүмкіндіктер:
<br/>Яндекс, Google, Bing, Mail, Нигма, Qip, Poisk, Genon-да матчтарды іздеу;
<br/>бірегей емес мәтін бөлімдерін тікелей веб-беттің қайталанған көшірмесінен тауып, бөлектеңіз;
<br/>сіріңкелер пайызына сәйкес әр түрлі түстердегі ерекше емес фрагменттерді белгілеңіз;
<br/>әртүрлі іздеу параметрлерін конфигурациялау мүмкіндігімен мазмұнның бірегейлігін тексеру туралы егжей-тегжейлі есептер жасау - мәтіннен алынған үлгілер саны, бір сөздегі сөздер және т.б.;
<br/>папкадағы барлық файлдарға пакеттік тексеруді жүргізу және файлдағы мекенжайлар тізіміне сүйене отырып, мекенжайлар әр түрлі сайттарға тиесілі болуы мүмкін: авторизация арқылы жеке файлдарды қоса, прокси тізімімен жұмыс жасау;
<br/>сайтта егжей-тегжейлі есеп беру арқылы сайттың барлық беттерін бірегейлігіне тексеріңіз;
<br/>Antigate қызметін қолдана отырып, captcha (Яндекс, Нигма және Пошта үшін) туралы біліңіз;
<br/>көрсетілген қалтадағы файлдарды бірегейлігі бойынша сұрыптау
<br/>тексеру журналын жүргізу.
<br/>4.	www.bilimsite.kz. 
<br/>Ұстаздарға арналған танымдық- әдістемелік сайт
<br/>5.	https://www.zhasalash.kz/ 
<br/>Zhasalash.kz сайты – мәтін түрінде, бейнекөрініс, аудиподкаст, сурет және дыбыстық слайдтар, видеослайдтар арқылы ақпарат тарататын дербес мультимедиялық жоба. Сайттың негізгі ұстанымы – анық ақпарат тарату, бейтараптық, сөз бостандығы, адам құқықтарының сақталу принциптерін ұстану, насихат жасаудан аулақ болу, журналистикаға тән барлық этикалық талаптарға сай болу.
<br/>6.	http://rmebrk.kz/
<br/>Қазақстанның Республикалық ЖОО-аралық электронды кітапханасы.
<br/>7.	http://www.philology.ru/  
<br/>Philology.ru филологиялық порталы - интернетте филологияға қатысты әртүрлі ақпаратты теориялық және қолданбалы ғылым ретінде ықшам түрде ұсынуға әрекет. Порталдың орталық бөлімі - филологиялық мәтіндер (монографиялар, мақалалар, оқу құралдары) кітапханасы.
<br/>8.	Kitap.kz 
<br/>Kitap.kz – қазақ және әлем әдебиетінің үздік шығармаларын оқу және тыңдау мүмкіндігін ұсынатын ауқымды онлайн платформа. Мұнда ұлттық әдебиетіміз бен отандық ғылымның, өнеріміз бен сан-саладағы шығармашылық өкілдеріміздің жәдігерлері заңды негізде жинақталған.
<br/>"Қазақстанның ашық кітапханасы" тек қазақ әдебиеті шығармаларымен ғана шектелмейді, осы кезеңге дейін қазақ тіліне аударылған шетел әдебиетінің де көрнекті туындылары оқырман назарына ұсынылып келеді. Қазір қорымызда 600-ден аса әлем әдебиетінің жауһарлары бар.
<br/>Сондай-ақ, қазақ әдебиетінің шетел тілдеріне аударылған үздік шығармаларында да біздің кітапханадан таба аласыз. Балаларға арналған әңгіме, өлеңдермен қатар, түрлі тақырыптағы ертегілердің аудионұсқасы жасалды. Жобаның арқалаған жүгі салмақты: жаһандану дәуірінде ұлттың құндылықтарын сақтауға ұмтылу, сондай-ақ, интернет желісінде қазақтілді мазмұнды арттырып, тіліміздің қолданыс аясын кеңейтуге күш салу.
<br/>9.	https://www.wdl.org/ Дүниежүзілік сандық кітапхана (WDL) әлемнің мәдениетін ұсынатын көптеген материалдарға көп тілді форматта Интернетке ақысыз қол жетімді кітапхана.
<br/>Дүниежүзілік сандық кітапхананың негізгі мақсаттары:
<br/>Халықаралық және мәдениет аралық түсінуді насихаттау.
<br/>Интернеттегі мәдени мазмұнның көлемін және әр түрлілігін кеңейту.
<br/>Оқытушыларға, академиктерге және барлық мүдделі тараптарға ресурстармен қамтамасыз ету.
<br/>Әріптес мекемелерге елдер ішіндегі және арасындағы сандық теңсіздікті азайтуға мүмкіндік беру.
<br/>10.	http://kazneb.kz/  Қазақстандық Ұлттық электронды кітапхана
<br/>11.	https://uchi.kz/ 
<br/> Uchi.kz - Қазақстандағы және шетелдегі білім туралы портал
<br/>Көптеген пайдалы және ерекше материалдар: білім беру жаңалықтары , мақалалар мен ҰБТ , университеттерге қабылдау ; грант және конкурс туралы хабарландырулар ; , үміткерлердің сұрақтарына жауап беру - біз үнемі өз порталымызды жетілдіріп отырамыз, ол мектеп оқушыларының, студенттердің, олардың ата-аналары мен мұғалімдерінің - жалпы «Қазақстанда және шетелде білім алу» тақырыбына қызығушылық танытатындардың бәрін тартады.
<br/>
<br/>
<br/>12.	https://www.abai.kz/
<br/>Бұл сайт - Абай мұрасын, Алаш өсиетін кешенді түрде насихаттап, жарық көрген кітаптар мен баспасөзде басылған таңдаулы мақалаларды бір арнаға топтастырып, оны әлемтор арқылы әлемге паш етеді! Абайшыл әм Алаш ұранын мұрат тұтқан  қазақ елінің шынайы патриоттарын қалыптастыру ісіне үлес қосу.
<br/>13.	http://qasym.kz/ 
<br/> Жаһандық желіні пайдаланушылар «Қасым» порталынан ақынның тағдыры мен жасампаз шығармашылығы жайында толыққанды ақпарат ала алады. Тарқатып айтсақ, дауылпаз ақынға арналған портал «Қасым-тағдыр», «Поэзия», «Аудармалар», «Көсемсөз», «Драма», «…өз жайымда», «Қасымтану», «Бір күй бар», «Қасым-әлем», «Дүниеге келер әлі…», «Жанартау», «Фотошежіре», «Бейнебаян» сияқты бөлімдерден тұрады. Әрбір бөлімнің мәйекті мақалалары, сүбелі ойлары және сүйекті ұсыныстары қасымшыл оқырмандар үшін топтастырылған. Азаттықтың арынды ақынына арналған әдеби порталдан Қ.Аманжоловтың 100 жылдығына орай республика көлемінде өтіп жатқан іс-шаралар жайлы білуге болады.
<br/>14.	http://www.myshared.ru/ 
<br/>Презентациялар жинағы.
<br/>15.	http://www.analizfamilii.ru/ - 
<br/>Фамилияларға фоносемантикалық талдау
<br/>Журавлев әдісі бойынша орыс тілді адамдардың сөздердің дыбыстарын психологиялық қабылдауын талдау. Веб-сайтта сіздің фамилияңызды, атыңызды, компанияның атауын, сауда маркасын және т.б.
<br/>16.	http://lingvo.asu.ru/golev/ - Николай Данилович Голевтің жеке сайты
<br/>Николай Данилович Голев - Кемерово мемлекеттік университетінің орыс тілі кафедрасының профессоры, лингвистикалық сарапшылар лексикасы қауымдастығының басқарма төрағасы. Сайтта ұсынылған авторлық жұмыстардың тақырыптары: дериватология; диалектология; ойын гомофондары; табиғаттың сөздік қорын; морфология; жалпы тіл білімі; ономесиология; емле және тыныс белгілері; семасиология, лексикография; тестілеу; көркем мәтін; юрислингистика.
<br/>17.	 http://www.humlang.newmail.ru/ 
<br/>Адам тілі. Өзара ақпарат алмасу, адамның табиғи тілінің табиғаты, оның басқа табиғи тілдермен (жануарлар тілдері) байланысы мәселелерін талқылау және т.б.
<br/>
<br/>18.	http://efault.ru/  
<br/>Энциклопедиялық сөздік
<br/>
<br/>19.	http://www.languagestudy.com/
 <br/>Шет тілдерін үйренуге арналған негізгі қор.
<br/>20.	http://lib.biblioclub.ru/
<br/>Көркем емес кітапхана (lib.biblioclub.ru) - ғылыми және оқу әдебиеттері, өзін-өзі дамыту және интеллектуалды бос уақыт туралы жарияланымдар (бонус ретінде - көркем әдебиеттің бір бөлімі ) бар электрондық кітапхана.
<br/>Электрондық кітаптарға кітапханалық компьютерлерден, сондай-ақ кез-келген мобильді құрылғылардан (компьютерлер, планшеттер, смартфондар) немесе Интернет желісі бар кез-келген жерден мобильді қосымшадан қол жеткізуге болады
<br/>21.	https://kniga-free.ru/           Бұл сайтта сіз электронды кітаптарды, сөздіктер мен энциклопедияларды жүктеуге болатын сілтемелер бар . Интернетте бірқатар кітаптар мен сөздіктер бар (On-line).  жақын арада бұл тегін кітапхананы толықтырады. Жүктеуден бұрын файлдарды бөлісу қызметтерінің иелеріне кездейсоқ ақша төлемеу үшін кітаптарды қалай тегін жүктеу туралы нұсқаулықты мұқият оқып шығуды ұсынамыз
<br/>22.	www.pedagog.kz  Озат педагогтардың Республикалық ортақ интернет ресурсын қалыптастыратын сайт. Үздік жұмыстарды насихаттау, тарату. Жас мамандарға керекті кеңестер беру, талантты оқушылардың жұмыстарын  жалпыхалықтық деңгейде насихаттау. 
<br/>23.	https://martebe.kz/ 
<br/>Martebe.kz білім порталы – еліміздегі мұғалімдер мен білім алушы жастардың басын біріктіретін бірегей жоба. Порталда сіз өзіңізге керекті ақпараттар мен қызықты мақалаларды оқумен қатар, өзіңіз де материал жіберіп, жеке блогыңызды жүргізе аласыз. Порталда өзіңіздің қызықты оқиғаларыңыз бен мақалаларыңызды жариялап,  шығармашылығыңызды дамыта аласыз.
<br/>24.	https://kitaphana.kz/  
<br/>Виртуалды кітапхана.
<br/>25.	https://www.mindmeister.com/ru?r=117822
 <br/>MindMeister - интернеттегі ойды картаға түсіру құралы, ол көзбен көруге, дамытуға және бөлісуге мүмкіндік береді. Қазірдің өзінде 13 миллион астам адам біздің пайдаланып отырған марапатты ақыл картасы редактор үшін ми шабуылы , жазбаларды ескере отырып , жоспарлау жобаларын, және басқа да көптеген шығармашылық міндеттерді. MindMeister - бұл веб-қосымша, бұл жүктеулер мен жаңартулардың болмауын білдіреді! Windows, Mac OS немесе Linux-та жұмыс жасағаныңыз маңызды емес, сіз әрқашан интернеттегі шолғышта интеллектуалды карталарыңызға қол жеткізе аласыз.
<br/>26.	http://www.interesno.com/ 
<br/>Әртүрлі тақырыптағы қызықты және пайдалы сайттарды біріктіретін жүйе.
<br/>Сіз олардың кез-келгеніне, мысалы, interesno.com сайтына бір рет тіркелу арқылы сіз біздің сайт ұсынатын барлық мүмкіндіктерге қол жеткізе аласыз.
<br/>
<br/>27.	https://www.ted.com/ 
<br/>TED - әдетте қысқа, күшті келіссөздер түрінде идеяларды таратуға арналған партит емес коммерциялық емес ұйым. TED 1984 жылы Технологиялар, Көңіл көтеру және Дизайн біріктірілген конференция ретінде басталды және бүгінде 110-нан астам тілде ғылымдан бастап бизнестің жаһандық мәселелеріне дейінгі барлық тақырыптарды қамтиды. Сонымен қатар, TEDx іс-шараларын тәуелсіз түрде өткізу бүкіл әлемдегі қауымдастықтарда идеялармен бөлісуге көмектеседі.
<br/>28.	https://www.doabooks.org/  DOAB-тың негізгі мақсаты - ашық қол жетімді кітаптардың ашылуын арттыру. Академиялық баспагерлерге DOAB-қа ашық қол жетімділік кітабының метадеректерін ұсынуға шақырады. Метамәліметтерді таратуды, көрінуді және әсерді барынша арттыру үшін жинауға болады. Агрегаторлар жазбаларды өздерінің коммерциялық қызметтеріне және кітапханалар интернеттегі каталогқа біріктіре алады, ғалымдар мен студенттерге кітаптарды табуға көмектеседі. Ашық қол жетімділікте академиялық және рецензияланған кітаптарды шығаратын барлық баспагерлер үшін ашық және бұл кітаптар ашық қол жетімділікте және академиялық стандарттарға сай болған жағдайда мүмкіндігінше көп кітап болуы керек.
<br/>29.	https://www.public.ru/  Орыс тілді ақпарат көздерінен ыңғайлы іздеу - газеттер, журналдар, ақпараттық агенттіктер және интернет-басылымдар. Адамдар, компаниялар немесе оқиғалар туралы ақпаратты тез әрі ыңғайлы алыңыз. Public.ru-да деректерді талдауға және бейнелеуге арналған барлық құралдар бар: тақырып бойынша тұрақты жинақтар, дереккөздер мен аймақтар бойынша сұрыптау.
<br/>30.	http://www.argumentation.ru/index.php/lphs 
<br/>«Логикалық және философиялық зерттеулер» электрондық ғылыми мерзімді басылымында Санкт-Петербург пен Ресейде қазіргі логика және логикалық және философиялық білім саласындағы пәнаралық халықаралық академиялық ғылыми-педагогикалық кеңістікті құруға және қолдауға бағытталған мақалалар жарияланады
<br/>
<br/>31.	https://www.gov.kz/memleket/entities/edu?lang=kk.
<br/>Қазақстан Республикасы Білім және ғылым министрлігі білім, ғылым, балалардың құқықтарын қорғау және жастар саясаты салаларында басшылықты жүзеге асыратын мемлекеттік орган.
<br/>32.	http://lib.ru/ 
<br/>Авторлар мен оқырмандар оны күн сайын толықтырады. Көркем әдебиет, ғылыми фантастика және саясат, техникалық құжаттама және әзіл-оспақ, тарих және поэзия, ПХД және орыс рок, туризм және парашют, философия және эзотеризм және т.б. және т.б.
<br/>
<br/>33.	https://bookcenter.kz/ 
<br/>Онлайн кітап дүкені.
<br/>
<br/>34.	http://library.kz/kz/ 
<br/>
<br/>   Кітапхана қоры ұлттық және шетелдік басылымдар, диссертациялар, ғылыми еңбектер және Қазақстан ғалымдарының жеке кітапханаларының аса бай  жиынтығынан тұрады. Деректердің ауқымы  өте үлкен:қолжазбалардың  түпнұсқалық  түрінен бастап, заманауи  электронды ақпарат тасымалдаушыларға дейінгі аумақты қамтиды.
<br/>35.	http://iie.kz/ 
<br/>
<br/>Институт жұмысының негізгі мазмұны отандық тарихтың, этнологияның, антропологияның, тарихнаманың, тарихи демографияның, мәдениет және ғылым тарихының, этносоциологияның іргелі мәселелерін зерттеуге, сонымен қатар ғылыми зерттеудің жаңа әдістерін айналымға енгізуге негізделген.
<br/>36.	http://almatymuseum.kz/en 
<br/>Алматы мұражайы 2001 жылы құрылды. Ол Жетісу өңірінің тарихи-мәдени мұрасының толыққанды ұсынатын ірі ғылыми және мәдени орталыққа айналды. Музей коллекциясы 35 мыңнан астам жәдігерден тұрады, оның ішінде өнер туындылары, қазіргі Алматы қаласының халықтарының этнографиялық және этнографиялық материалдарының ерекше коллекциясы, әр түрлі жастағы және мәдениеттегі тұрмыстық заттар коллекциясы, сондай-ақ түрлі монеталар, фотолар бар және құжаттар.
<br/>37.	https://www.nis.edu.kz/
<br/>Зияткерлік мектеп бастауыш мектеп (оның ішінде мектепке дейінгі тәрбие мен оқыту), бастауыш мектеп және орта мектеп деңгейлері бойынша білім беру бағдарламаларының заманауи үлгілерін әзірлеу, бақылау, зерттеу, талдау, тестілеу, енгізу және іске асырудың тәжірибелік алаңына айналуға арналған.
<br/>38.	http://orleu.kz/ 
<br/> Жинақ мектеп мұғалімдеріне, педагогикалық ЖОО студентерріне арналған. Оқу үрдісін жандандыру, педагогикалық инновациялық тәжірибе жинақтап тарату, оқытудың әдістерімен тәсілдерінің пәнді игерудің тың технологиясын іздестіру, оқушылардың білім деңгейін, оқу ынтасын, белсенділігін арттыруды тәжірибеде іске асыратын, шығармашылықпен, ғылым мен тәжірибе тоғысында заман талабымен жұмыс жасайтын, білім беру жүйесін дамытуға ықпал ететін дарынды ұстаздарды анықтау мақсатында өткізілген іс-шараларға қатысушы ұстаздар еңбектерін (материалдарын) жинақтау, республикалық деңгейде бір жерге топтастыру жұмыстары жүргізіледі.
<br/>
<br/>39.	https://obuchalka.org/
<br/>Оқу құралы академиялық (ғылыми және іскери) жазу және ағылшын тілінде сөйлеу дағдылары мен дағдыларын үйретуге бағытталған. әр түрлі мәтіндердің негізі (проблеманы сипаттау және оны шешу,  сипаттамамен таныстыру, презентация-жалпылау). Жоғары оқу орындарының студенттеріне, магистранттар мен ағылшын тілін оқитын студенттерге арналған.
<br/>40.	http://www.kazakhtest.kz/
<br/>Қазақ тілін меңгеру деңгейін бағалау жүйесі - ҚАЗТЕСТ
<br/> Kaztest жүйесі Ұлттық тестілеу орталығы негізінде 2006 жылы Қазақстан Республикасы азаматтарының және Қазақстан Республикасының аумағында жұмыс істейтін шетелдік азаматтардың қазақ тілін білу деңгейін бағалау мақсатында құрылды.
<br/>41.	https://www.abai.kz/post/7404
<br/>Осы сайттан Қазақстанның танымал дәулескер күйшілері мен дарынды жас күйшілерін, сондай-ақ халық арасындағы күйші өнерпаздарды қатыстырып жазылған «Күй дария» деп аталатын авторлық бағдарламамды және осы күйшілердің орындауындағы күйлерді тыңдай аласыз.
<br/>
<br/>42.	https://akberen.com/
<br/>Ақберен Елгезеков жайлы мәліметтер жинақталған сайт.
<br/>43.	http://www.resurs.kz/catalog/topreferat
<br/>Бұл сайтта Қазақстанның түкпір-түкпірінен жиналған қазақ тіліндегі рефераттар мен курстық және дипломдық жұмыстар ұсынылған.
<br/>44.	https://josparlar.kz/
<br/>Ұстаздарға арналған сабақ жоспарлар сайты.
<br/>45.	https://www.el.kz/
<br/>қААқпараттық - танымдық портал.
<br/>46.	http://www.philology.ru/ - Philology.ru –
<br/> Орыс филологиялық порталы. Теориялық және қолданбалы ғылым ретінде филологияға қатысты әртүрлі ақпараттарды Интернетте ықшам түрде ұсынуға тырысатын Мәскеу, Новосибирск және Прага филологтарының жобасы. Порталдың негізін филологиялық мәтіндер (монографиялар, мақалалар, оқу құралдары) құрайды.
<br/>47.	http://www.onoma.newmail.ru/ - Ресей ономастикасы
<br/>Ономастикаға арналған сайт - тиісті атаулар туралы ғылым. Кәсіби ономатологтар мен тілдің ономастикалық бөлімшелерін жаңадан зерттеушілерге арналған. Ономастиканың негізгі бөлімдері туралы теориялық ақпарат: антропонимия, топонимия, этнонимия, әдеби ономастика және т.б., орыс ономастикасы туралы библиография. Атаулар, фамилиялар, географиялық атаулар туралы түсінік беру. Ономастика жаңалықтары, Ресейде және жақын және алыс шетелдерде өткізілген лингвистикалық ғылыми конференциялар туралы ақпарат. Басқа ономастикалық Интернет-ресурстарға сілтемелер. Ресейдің ономастикасы туралы электрондық жарияланымдар.
<br/>48.	http://www.inion.ru/ - Әлеуметтік ғылымдар туралы ғылыми ақпарат институты (INION)
<br/>Әлеуметтік және гуманитарлық ғылымдарға арналған INION библиографиялық мәліметтер базасы 1980 жылдан бері жұмыс істейді. Оларға әлемнің 140 тіліндегі журналдар мен жинақтардағы кітаптар мен мақалалардың аннотациялары, INION кітапханасында сақталған қолжазбалар мен диссертациялардың тезистері кіреді. Кейбір сипаттамаларда INION электрондық қоймасынан және электронды баспалардан алынған дереккөздердің толық мәтіндеріне сілтемелер келтірілген. Барлық мәліметтер базасы еркін қол жетімді. Қосымша тіркеу мақалалардың электронды көшірмелеріне тапсырыс беруге мүмкіндік береді.
<br/>49.	http://www.lecton.perm.ru/ - Lecton
<br/>Тіл және лингвистика философиясы бойынша мәтіндер кітапханасы, Пермь аспиранттарының мақалалары мен тезистері, «Тіл философтары» дәйексөздері. Негізгі бөлімдері - «Ғылыми фантастика» және «Ғылыми фантастика тілі», бұл әдебиет жанрына тән лингвистикалық ғылыми фантастика мен арнайы лексикаға арналған. Қонақтар кітабы және пайдалы сілтемелер бөлімі бар.
<br/>50.	http://kls.ksu.ru/ - Қазан лингвистикалық мектебі
<br/>«Қазан лингвистикалық мектебі» сайты Қазан мемлекеттік университетінің филология факультетінің теориялық және қолданбалы лингвистика кафедрасында кафедра қызметкерлері мен студенттері «Татарстандағы орыс тілі» республикалық мақсатты бағдарламасы аясында құрылды. Сайтта: Қазан лингвистикалық мектебі өкілдерінің библиографиясы; Қазан лингвистикалық мектебі өкілдерінің еңбектері (И.Баудуин де Куртенай, А.И. Александров, А.И. Анастасьев, А.С. Архангельский, В.А. Богородицкий, С.К.Булич, П.В. Владимиров, Н.В.Крушевский, Н.С.Кукуранов, В.В.Радлов); мектептің тарихымен және мектептегі дәстүрлер шеңберіндегі заманауи зерттеулермен байланысты материалдар; қысқаша аннотациялары бар Қазан лингвистикалық мектебі мен оның өкілдеріне арналған интернет-ресурстар тізімі.
<br/>51.	http://philologos.narod.ru/ - POETICA
<br/>Тіл және әдебиет теориясы бойынша материалдар. Бөлімдер: «Тақырыптар мен мәтіндер», «Оқулықтар», «Библиография», «Мәтін теориясы», «Жеке тұлға» (желідегі сирек кездесетін жұмыстардың үзінділері - А.А. Потебни, Б.М.) С. Трубецкой, Г.П. Мельников, С.С. Аверинцев). Сонымен қатар «Әлем мифтері», «Суретші және әдебиет», «Изосемиотика», «Өнер философиясы» бөлімдері бар.
<br/>52.	http://www.russkie-slovari.ru/ - орыс тілі. Орыс грамматикасы.
<br/>Жиырма томнан астам интерактивті сөздіктер. Орыс грамматикасы. Орыс тіліндегі қызмет. Шетелдік сөздіктер, семантикалық, емле, синонимдер, арго, орыс мат, жеке есімдердің сөздіктері. Далл сөздігі. Пушкин, Достоевский тілдерінің сөздіктері. Достоевский тілінің сөздігі. Сөздердің тарихы. Орыс тіліндегі ондаған анықтамалық және библиографиялық материалдар.
<br/>Omniglot.com – түркітану саласында, жалпы тіл білімі саласында глоттохронологиялық, салыстырмалы тіл білімімен айналысып жүрген зерттеушілерге қажетті мәліметтер кездеседі. Бұл тілдер мен жазу жүйесіне арналған онлайн энциклопедия. Ол жерде түрлі тілдік семьялардағы тілдердің тіл тарихы, жазу жүйесі, тілдік еркешелігі, фонетикасы, грамматикасы, лексикасы, т.б. туралы мәліметтер бар.
<br/>starling.ru – мультитілді мәтіндермен, транскрипт таңбаларымен, ыңғайлы іздеумен, Зализняк сөздігіне сәйкес сөз формаларын талдаумен және синтездеумен, Мюллер сөздігі арқылы аударумен жұмыс істеуге мүмкіндік беретін жүйе. Бұнда салыстырмалы-тарихи зерттеулерге (глоттоохронология) арналған функциялар да бар. Сайтта on-line режимінде әртүрлі тілдерге арналған этимологиялық мәліметтер базасы бар.
<br/>sozdik.kz – электронды сөздігі. Сөздер тура мағынасында, ауыс мағынасында және түрлі ғылым саласындағы терминдік мағынасында аударылады. Сөздік орыс-қазақ тілі тілдік жұптары арасында аударма жасайды.



			</p>
		</div>
			
		</div>
		</React.Fragment>
	);
}