import React from 'react';
import Main from './Main';
import './styles/First.css';
import table1 from '../assets/table1.png';
import table2 from '../assets/table2.png';

export default function Third(){
	return(
		<div className="third">
			<Main name="Қазақ тіліндегі диалект базасы" desc =""/>
			<div className="sites">
				<div className="blocks">
					<p>
					<strong>АБДАП</strong> (Арал) лебі, ызғары. Бұл жердің салқын болуы, теңіздің абдабы бар ғой (Арал).
<br/><br/><strong>АБЫ ЖАУҚЫН</strong> (Алматы, Жамбыл) азғантай. Абы жауқын ауқат болды (Алматы, Жамбыл).
<br/><br/><strong>АБЫЛАУ</strong> (Шығыс Қазақстан, Зайсан) жан-жағынан айнала қоршап, қамалау. Аңдарды ұстаудың ең бір қолайлы әдісі – абылау жасау болатын, бүгінде бұл қойылды (Шығыс Қазақстан, Зайсан).
<br/><br/><strong>АБЫЛАҢҚЫ</strong> (Орал, Жымпиты ауданы) сөзі көп, сөзуар адам. Абылаңқы адам (Орал, Жымпиты ауданы).
<br/><br/><strong>АБЗАЛЫ</strong> (Қарағанды облысы) кей уақытта.
<br/><br/><strong>ӘБІНАУАТ</strong> (Жамбыл облысы, Шу, Мерке, Қордай, Луговой ауданы) дәу сары қауын. Әбінауаттың суы тәтті болады (Жамбыл облысы, Шу).
<br/><br/><strong>ӘБІС</strong> (Алматы облысы, Кеген ауданы) әбес, өрескел, қате. Сен тағы бір әбіс іс істедің (Алматы облысы, Кеген ауданы).
<br/><br/><strong>ӘБДЕН ТЫСҚАРЫ</strong> (Жамбыл облысы, Талас ауданы, Сарысу ауданы) шамадан тысқары. Әбден тысқары нәрсеге сенуге болмайды (Жамбыл облысы, Талас ауданы).
<br/><br/><strong>БАҒУ </strong>(Қарағанды облысы) істей алу, орындай алу. Ол жұмыс істеп бағады (Қарағанды облысы).
<br/><br/><strong>БАҒЫСТАП ҰСТА</strong>У (Ақтөбе облысы, Ырғыз ауданы) кір шалдырмай таза ұстау. Қарағым, қазанды бағыстап ұста! (Ақтөбе облысы, Ырғыз ауданы).
<br/><br/><strong>БАҒЫШ ЕТУ</strong> (Гурьев ауданы, Маңғыстау ауданы) меншіктеу. Мен осы бір көйлекті өзіме бағыш етіп едім, енді Суқанға бергелі отырмын (Гурьев ауданы, Маңғыстау ауданы).
<br/><br/><strong>БАҒЫТ1</strong> (Гурьев ауданы, Маңғыстау ауданы) тұрақтылық. Ауа-райы бірде суық, бірде жылы – бір бағыт жоқ екен мұнда. 
<br/><br/><strong>БАҒЫТ2</strong> (Алматы облысы, Еңбекші қазақ ауданы) уақыт. Қауынды бағытында суғарып тұру керек.
<br/><br/><strong>ЖЫРЫМ1</strong> (Көкшетау облысы, Қызылту ауданы) айылдың ұшына жалғанған қайыс. 2. (Қарағанды облысы, Шет) Айылдың атқа мінер жағындағы ерге ілетін, байлайтын жері.
<br/><br/><strong>ЖЫРЫМДА ЖОҚ</strong> (Қостанай облысы, Жангелдин ауданы) жадымда жоқ, есімде жоқ. Менің жырымда жоқ.
<br/><br/><strong>ЖЫРЫНТҰҚАЙ</strong> (Қызылорда облысы, Арал) жырынды.
<br/><br/><strong>ЖЫТПА</strong> (Көкшетау облысы, Щучье ауданы, Еңбекшілдер ауданы) маядан шөп суырғыш.
<br/><br/><strong>ЖЫТЫ</strong> (Ақтөбе облысы, Ырғыз ауданы, Қызылорда облысы, Арал) жүйрік, ұшқыр. Жыты атпен аң аулайды.
<br/><br/><strong>ЖЫЮ1</strong> (Семей облысы, Ақсуат ауданы, Көкпекті ауданы) шығу, аяқ басу (жас туралы). Мен 31-ден 32-ге жыйамын, бізді жас деуге болмайды.
<br/><br/><strong>ЖЫЮ2</strong> (Семей облысы, Көкпекті ауданы, Ақсуат ауданы) қалау, өру. Төреғалидің үйі дұрыс жыйылған еді.
<br/><br/><strong>ЖІБІР</strong> (Гурьев ауданы, Маңғыстау облысы) жебір. Мешкей, жібір, жұтқыштан жолдас жиған.
<br/><br/><strong>КӨН</strong> (Қостанай облысы, Обаған ауданы) қыстақ.
<br/><br/><strong>КӨМЕШ</strong> (Ақтөбе облысы, Ойыл) пешке пісірілген бөлке нан. Ақкөмеш түсіп пе дүкеге, біле келші (Ақтөбе облысы, Ойыл).
<br/><br/><strong>КӨМКЕ</strong> (Талдықорған облысы, Талдықорған ауданы) жолаушылар таситын машина. Бір кісі бізге қарай келді де, көмке тоқтайтын жер қайда деп сұрады.
<br/><br/><strong>КӨМУ1</strong> (Қызылорда облысы, Арал) негізін салу, іргесін қалау. Сәрсеке, тамыңды көмдің бе, қалай? 
<br/><br/><strong>КӨМУ2</strong> (Қостанай облысы) нан пісіру, нан жабу. Біз нанды осында өзіміз көмеміз.
<br/><br/><strong>КӨМІН КЕТУ</strong> (Жамбыл облысы, Жуа) дүниеден өту, қайтыс болу. Тұяқ атаулыдан жалғыз бала бар еді, ол да көмін кетті.

<br/><br/>Қатон - Қарағай ауданында "бөстек"(көпшік), "шоқпыт"(тряпка), "қамыс"(ет турайтын тақтайша), "биялай"(қолғап), "күлапара"(капешон), "шақал"(кішкентай), "еееа"(иə) десе. Зайсан, Тарбағатай өңірінде "щемішке"(сеймички), сейңке(веранда), тəпішпақ, шарқай(тапочка), кəтел(шелек), бақыр(ожау), алқа(сырға). Күршім, Марқакөл өңірлерінде "діңке"(қауын), леген(тазик), əгуршік(огурцы), күпəна(шөптің отауы)
   <br/><br/><strong>(Күнбағыс майы)</strong>
<br/>Сумай — Алматы, 
<br/>Сұйық май — Солтүстік Қазақстан, Талдықорған, Алматы 
<br/>Шағу май — Батыс Қазақстан  
<br/>Шемішке май — Орталық Қазақстан, Атырау.

     <br/><br/><strong>(Майлық)</strong> 
<br/>Сулық — Батыс Қазақстан 
<br/>Шашық — Оңтүстік Қазақстан 
<br/>Орамал — Орталық Қазақстан.
<br/>  <br/> <strong>(Кесе)</strong>
<br/>Шыны — Алматы 
<br/>Пиала — Оңтүстік Қазақстан 
<br/>Кәсе — Батыс Қазақстан
<br/>  <br/> <strong>(Өте үлкен)</strong>
<br/>Дәу — Орталық Қазақстан, Тараз, Алматы 
<br/>Нән — Батыс Қазақстан 
<br/>Дәкөй — Көкшетау 
<br/>Зор — Оңтүстік Қазақстан
<br/>   <br/><strong>(Леген)</strong> 
<br/>Табақ — Батыс Қазақстан 
<br/>Шылапшын — Батыс, Оңтүстік Қазақстан 
<br/>Кірші — Алматы
<br/>   <br/><strong>(Жеңге)</strong>
<br/>  Жеңеше — Қызылорда
<br/>Тәтай апа — Батыс Қазақстан 
<br/>Жише — Оңтүстік Қазақстан
<br/>Дише — Тараз

					</p>
					<img src={table1} alt=""/>
					<img src={table2} alt=""/>
				</div>
			</div>
		</div>	
	);
}
